Revit 2026 API

# SweepProfile Properties

---

The SweepProfile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

#### Reference

SweepProfile Class

Autodesk.Revit.DB Namespace